---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LevelDataSurfaceArea
source: html/540fb805-da7a-f4a1-a758-aae2a1bd28ab.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LevelDataSurfaceArea Property

"Exterior Surface Area"

## Syntax (C#)
```csharp
public static ForgeTypeId LevelDataSurfaceArea { get; }
```